## Pandas DataFrames I - Working with Columns

In [82]:
import pandas as pd
data = [['Dan', 30, 40000], ['John', 40, 50000],
       ['Helen', 35, 60000], ['Marry', 29, 58000]]

df = pd.DataFrame(data=data, columns=['Name', 'Age', 'Salary'])

In [83]:
type(df), type(df['Age'])

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [84]:
df.shape

(4, 3)

In [85]:
df.shape[0]

4

In [86]:
df

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000
3  Marry   29   58000

In [87]:
df.info

<bound method DataFrame.info of     Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000
3  Marry   29   58000>

In [88]:
df['Name']

0      Dan
1     John
2    Helen
3    Marry
Name: Name, dtype: object

In [89]:
df.Name

0      Dan
1     John
2    Helen
3    Marry
Name: Name, dtype: object

In [90]:
df.Age

0    30
1    40
2    35
3    29
Name: Age, dtype: int64

In [91]:
df['Phone'] = ['111111', '22222', '33333', '44444']  #Adding a new column

In [92]:
df

    Name  Age  Salary   Phone
0    Dan   30   40000  111111
1   John   40   50000   22222
2  Helen   35   60000   33333
3  Marry   29   58000   44444

### Dropping Rows and Columns

In [93]:
df.drop(2, 0)  # Dropping a row

    Name  Age  Salary   Phone
0    Dan   30   40000  111111
1   John   40   50000   22222
3  Marry   29   58000   44444

In [94]:
df.drop('Age', axis=1)  # Dropppin a column (it's not in-place)

    Name  Salary   Phone
0    Dan   40000  111111
1   John   50000   22222
2  Helen   60000   33333
3  Marry   58000   44444

In [95]:
df

    Name  Age  Salary   Phone
0    Dan   30   40000  111111
1   John   40   50000   22222
2  Helen   35   60000   33333
3  Marry   29   58000   44444

In [96]:
df.drop('Age', axis=1, inplace=True)

In [97]:
df

    Name  Salary   Phone
0    Dan   40000  111111
1   John   50000   22222
2  Helen   60000   33333
3  Marry   58000   44444

In [75]:
df.drop(1)  # dropping a row

    Name  Salary   Phone
0    Dan   40000  111111
2  Helen   60000   33333
3  Marry   58000   44444

In [98]:
df

    Name  Salary   Phone
0    Dan   40000  111111
1   John   50000   22222
2  Helen   60000   33333
3  Marry   58000   44444

### Renaming columns

In [77]:
df.rename(columns={'Name': 'First Name', 'Salary': 'Annual Salary'}, inplace=True)

In [78]:
df

  First Name  Annual Salary   Phone
0        Dan          40000  111111
1       John          50000   22222
2      Helen          60000   33333
3      Marry          58000   44444

In [79]:
df.columns = ['First Name', 'Annual Salary', 'Mobile Phone']
df

  First Name  Annual Salary Mobile Phone
0        Dan          40000       111111
1       John          50000        22222
2      Helen          60000        33333
3      Marry          58000        44444